# UpdaterName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterInfo..::..UpdaterName Property
UpdaterInfo Class See Also
---
Name of the updater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string UpdaterName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UpdaterName As String
	Get
```

Visual C++
---
```text
public:
property String^ UpdaterName {
	String^ get ();
}
```

# See Also
UpdaterInfo Class
Autodesk.Revit.DB Namespace